{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "clear_memories_on_bos_token_id": false,
  "clear_memories_on_eos_token_id": false,
  "eos_token_id": 128001,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "last_context_length": 128,
  "max_position_embeddings": 131072,
  "mem_dtype": "bfloat16",
  "mem_group_size": null,
  "mem_layer": 0,
  "mem_positionals": true,
  "memory_size": 128,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 16,
  "num_key_value_heads": 8,
  "pad_token_id": 0,
  "pooling_tokens": null,
  "position_type": "Continual",
  "pretraining_tp": 1,
  "ret_attn_layers": [
    0,
    1,
    2
  ],
  "ret_group_size": 4,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 32.0,
    "type": "linear"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.45.2",
  "update_boundary": "20,30",
  "use_cache": false,
  "use_gate": false,
  "vocab_size": 128256
}
